package com.guohuai.boot;

public enum BankCodeEnum {
	C0025840("0025840","邮政储蓄银行"),
	C3132611("3132611","哈尔滨银行股份有限公司"),
	C3132210("3132210"," 盛京银行"),
	C3131920("3131920","包商银行股份有限公司"),
	C3131460("3131460","廊坊银行股份有限公司"),
	C3131100("3131100","天津银行股份有限公司"),
	C3131000("3131000","北京银行股份有限公司"),
	C3102900("3102900","浦东发展银行"),
	C3091000("3091000","兴业银行"),
	C3085840("3085840","招商银行"),
	C3065810("3065810","广发银行"),
	C3051000("3051000","民生银行"),
	C3041000("3041000","华夏银行"),
	C3031000("3031000","光大银行"),
	C3021000("3021000","中信银行"),
	C3011000("3011000","交通银行"),
	C2011002("2011002","中国农业发展银行"),
	C2011001("2011001","中国进出口银行"),
	C2011000("2011000","国家开发银行"),
	C1051000("1051000","建设银行"),
	C1041000("1041000","中国银行"),
	C1031000("1031000","农业银行"),
	C1021000("1021000","工商银行"),
	C3163310("3163310","浙商银行股份有限公司"),
	C3154560("3154560","恒丰银行"),
	C3146530("3146530","重庆农村商业银行股份有限公司"),
	C3146510("3146510","成都农村商业银行股份有限公司"),
	C3146410("3146410","海口农村商业银行股份有限公司"),
	C3145880("3145880","佛山顺德农村商业银行股份有限公司"),
	C3145810("3145810","广州农村商业银行股份有限公司"),
	C3143056("3143056","张家港农村商业银行"),
	C3143055("3143055","江苏常熟农村商业银行股份有限公司"),
	C3143054("3143054","吴江农村商业银行"),
	C3143052("3143052","昆山农村商业银行"),
	C3143051("3143051","太仓农村商业银行 "),
	C3143040("3143040","江苏江南农村商业银行股份有限公司"),
	C3143022("3143022","江苏江阴农村商业银行股份有限公司"),
	C3143020("3143020","无锡农村商业银行股份有限公司"),
	C3141100("3141100","天津滨海农村商业银行股份有限公司"),
	C3138810("3138810","乌鲁木齐市商业银行中亚支行"),
	C3136530("3136530","重庆银行"),
	C3136020("3136020","东莞银行股份有限公司"),
	C3135910("3135910","广东南粤银行股份有限公司"),
	C3135850("3135850","珠海华润银行股份有限公司"),
	C3135841("3135841","上海银行"),
	C3135840("3135840","平安银行"),
	C3135810("3135810","广州银行股份有限公司"),
	C3134910("3134910","中原银行股份有限公司"),
	C3134510("3134510","齐鲁银行"),
	C3133451("3133451","浙江泰隆商业银行"),
	C3133450("3133450","台州银行股份有限公司 "),
	C3133387("3133387","浙江稠州商业银行股份有限公司"),
	C3133330("3133330"," 温州银行股份有限公司 "),
	C3133320("3133320","宁波银行股份有限公司"),
	C3133310("3133310"," 杭州银行股份有限公司"),
	C3133011("3133011"," 南京银行股份有限公司"),
	C3133010("3133010","江苏银行股份有限公司"),
	C4026110("4026110","广西壮族自治区农村信用社联合社"),
	C4026020("4026020","东莞农村商业银行股份有限公司"),
	C4025840("4025840","深圳农村商业银行"),
	C4025810("4025810","广东省农村信用社联合社"),
	C4025510("4025510","湖南省农村信用社联合社"),
	C4025211("4025211","武汉农村商业银行股份有限公司"),
	C4025210("4025210","湖北省农村信用社联合社"),
	C4024910("4024910","河南省农村信用社联合社"),
	C4024510("4024510","山东省农村信用社联合社"),
	C4024210("4024210","江西省农村信用社联合社"),
	C4023910("4023910","福建省农村信用社联合社"),
	C4023610("4023610","安徽省农村信用联社"),
	C4023320("4023320","宁波鄞州农村合作银行"),
	C4023310("4023310","浙江省农村信用社联合社"),
	C4023010("4023010","江苏省农村信用社联合社"),
	C4022610("4022610","黑龙江省农村信用社联合社"),
	C4022410("4022410","吉林省农村信用社联合社"),
	C4022210("4022210","辽宁省农村信用社联合社"),
	C4021910("4021910","内蒙古自治区农村信用社联合社"),
	C4021610("4021610","山西省农村信用社联合社"),
	C4021210("4021210","河北省农村信用社联合社"),
	C4021000("4021000","北京农村商业银行股份有限公司"),
	C3222900("3222900","上海农村商业银行"),
	C3205845("3205845","深圳龙岗国安村镇银行有限责任公司"),
	C3205844("3205844","深圳宝安桂银村镇银行股份有限公司"),
	C3205843("3205843","深圳南山宝生村镇银行股份有限公司"),
	C3205842("3205842","深圳福田银座村镇银行股份有限公司"),
	C3205841("3205841","深圳宝安融兴村镇银行有限责任公司"),
	C3205840("3205840","深圳龙岗鼎业村镇银行股份有限公司"),
	C3181100("3181100","渤海银行股份有限公司"),
	C3171100("3171100","天津农村商业银行"),
	C3135210("3135210","汉口银行"),
	C7872900("7872900","华一银行 "),
	C7855840("7855840","华商银行"),
	C6715840("6715840","渣打银行(中国）有限公司"),
	C5961000("5961000","企业银行(中国)有限公司"),
	C5951000("5951000","新韩银行(中国)有限公司"),
	C5931000("5931000","友利银行（中国）有限公司"),
	C5642900("5642900","瑞穗实业银行(中国）有限公司"),
	C5632900("5632900","三井住友银行(中国)有限公司"),
	C5615840("5615840","三菱东京日联银行（中国）有限公司"),
	C5315840("5315840","花旗银行(中国）有限公司"),
	C5105840("5105840","永亨银行(中国）有限公司"),
	C5095840("5095840","星展银行（中国）有限公司"),
	C5085840("5085840","大众银行"),
	C5045840("5045840","恒生银行(中国）有限公司"),
	C5032900("5032900","南洋商业银行有限公司"),
	C5022900("5022900","东亚银行(中国）有限公司"),
	C5012900("5012900","汇丰银行(中国）有限公司 "),
	C4028810("4028810","新疆维吾尔自治区农村信用社联合社"),
	C4028710("4028710","宁夏黄河农村商业银行股份有限公司"),
	C4028510("4028510","青海省农村信用社联合社"),
	C4028210("4028210","甘肃省农村合作社联合社"),
	C4027910("4027910","陕西省农村信用社联合社"),
	C4027310("4027310","云南省农村信用社联合社"),
	C4027010("4027010","贵州省农村信用社联合社"),
	C4026510("4026510","四川省农村信用社联合社"),
	C4026410("4026410","海南省农村信用社联合社");

	private String code;
	private String name;
	public String getCode() {
		return code;
	}
	public void setCode(String code) {
		this.code = code;
	}
	public String getName() {
		return name;
	}
	public void setName(String name) {
		this.name = name;
	}
	private BankCodeEnum(String code, String name) {
		this.code = code;
		this.name = name;
	}

	@Override
	public String toString() {
		return this.code;
	}

	/**
	 * 通过code取得类型
	 * 
	 * @param code
	 * @return
	 */
	public static String getName(String code) {
		for (BankCodeEnum type : BankCodeEnum.values()) {
			if (type.getCode().equals(code)) {
				return type.getName();
			}
		}
		return null;
	}

}
